<html>
<head>
      <link rel="stylesheet" type="text/css" href="Style1.css">
      <link rel="stylesheet" type="text/css" href="Text1.css">
      <link rel="SHORTCUT ICON" href="primer/pick.gif">
<style>
     #navbar {
        margin: 0;
        padding: 0;
        list-style-type: none;
        border: 4px solid #0066FF;
        border-radius: 180px 5px;
        width: 100% ;
        text-align: center;
        background-color:#666;
      }
      #navbar li { display: inline; }
      #navbar a {
        color: #fff;
        padding: 15px 30px;
        text-decoration: none;
        font-weight: bold;
        display: inline-block;
        width: 100px;
      }
      #navbar a:hover {
        border-radius: 20px 20px;
        background-color: #f90;
      }
    </style>
	  
    <Style>

  body { background-image: url(primer/fon.png) ;
-moz-background-size: 100%;
   -webkit-background-size: 100%;
   -o-background-size: 100%;
    background-size: 100%;
    }
    </Style>

</head>
<body>

<ul id="navbar">
      <li><a href="http://localhost/Heilig/Glava.php">На главную</a></li>
      <li><a href="ht1.php"> Основы языка HTML</a></li>
      <li><a href="ht2.php"> Структура HTML</a></li>
      <li><a href="ht3.php"> Тексты и абзацы</a></li>
      <li><a href="ht4.php"> Графики и гиперссылки</a></li>
      <li><a href="ht5.php"> Списки и таблицы</a></li>
      <li><a href="ht6.php"> Фреймы в HTML</a></li>
      <li><a href="ht7.php"> Мультимедийные возможности и Формы</a></li>
    </ul>
    
     <div class="form">
    <div class="container">
  <H4>                                             <p align="center">ПОЯСНИТЕЛЬНАЯ ЗАПИСКА</p> <hr/>

<p style="text-indent:20px"> В связи с тем, что в последнее время особенно бурно на всем земном шаре идет процесс информатизации, и все больший вес приобретают науки, связанные с общением, информатизацией и коммуникационными процессами, данный курс является актуальным и востребованным. Все больший вес в жизни людей занимает Интернет и технологии, связанные с работой в сети, умение создавать Web-сайты.</p>  

<p style="text-indent:20px"> Современному человеку требуется не только определенный набор знаний, а умения самостоятельно приобретать недостающие, применять их в жизни. Одним из таких умений является умение работать с компьютером.</p>

<p style="text-indent:20px">Темпы развития информатизации общества обгоняют учебные планы, образовательную программу. В ФГОС специальности  на эти темы отводится недостаточно времени, нет возможности организовать качественную индивидуальную работу, поэтому в рамках часов, отведенных на вариативную часть обучения введен ПМ.05 Разработка программных продуктов. В методических указаниях рассмотрен МДК.05.02 Современные веб-технологии. </p>

<p style="text-indent:20px">При изучении данного МДК  преследуем следующие цели:<br>
 -освоение знаний составляющих основу представлений об Интернете и интернет-технологиях;<br>
 -овладение умениями работать с различными видами объектов на веб-сайте;<br>
 -развитие познавательных интересов, интеллектуальных и творческих способностей средствами интернет-технологий;<br>
 -воспитание ответственного отношения к информатизации общества;<br>
 -выработка навыков применения средств интернет-технологий в повседневной жизни, при выполнении индивидуальных и коллективных проектов, в учебной деятельности,<br>
  -при дальнейшем освоении специальности.<br>

 <p style="text-indent:20px">Данный курс связан, прежде всего, с удовлетворением индивидуальных образовательных интересов, потребностей и склонностей обучащихся в зависимости от их интересов, способностей, последующих жизненных планов. </p>

                                                   <p align="center">Цели изучения курса</p>

<p style="text-indent:20px">Основными целями курса являются:
- научить учащихся ориентироваться и продуктивно действовать в информационном интернет-пространстве, используя для достижения своих целей создаваемые веб-ресурсы;
- сформировать у обучающихся целостное представление об информационной картине мира средствами Всемирной паутины, научить их способам представления информации - сети Интернет;
- познакомить обучащихся со способами научно-технического мышления и деятельности, направленными на самостоятельное творческое познание и исследование информационной части сетевого пространства;
- реализовать способности обучающихся в ходе проектирования и конструирования сайтов;
- сформировать элементы информационной и телекоммуникационной компетенций по отношению к знаниям, умениям и опыту конструирования.

                                                   <p align="center">Задачи курса</p>

<p style="text-indent:20px">Основными задачами курса являются:<br>
- познакомить с видами веб-сайтов, их функциональными, структурными и технологическими особенностями;<br>
- сформировать навыки элементарного проектирования, конструирования, размещения и сопровождения веб-сайта;<br>
- сформировать представление о языке HTML, о СSS и научить использовать их для создания и оформления веб-страниц;<br>
- сформировать навыки коллективной работы с комплексными веб-проектами.

                                                    <p align="center">Методы обучения</p>

<p style="text-indent:20px">Основная методическая установка курса — обучение навыкам самостоятельной индивидуальной и групповой работы по практическому конструированию сайтов.
Индивидуальное освоение ключевых способов деятельности происходит на основе системы заданий и алгоритмических предписаний, изложенных в упражнениях методических рекомендаций. Большинство заданий выполняется с помощью персонального компьютера и необходимых программных средств.
Наряду с индивидуальной, широко применяется и групповая работа, преимущественно в проектной форме. В задачи преподавателя входит создание условий для согласования понятий, которые будут использованы учащимися в конструировании авторских разработок. Выполнение проекта завершается защитой результата с последующей самооценкой.
Отбор методов обучения обусловлен необходимостью формирования информационной и коммуникативной компетентностей учащихся. 

                                                     <p align="center">Планируемые результаты курса</p>

<p style="text-indent:20px">В рамках курса обучащиеся овладевают следующими знаниями, умениями и компетенциями:<br>
- знают принципы и структуру устройства Всемирной паутины, формы представления и управления информацией в сети Интернет;<br>
- умеют найти, сохранить и систематизировать необходимую информацию из Сети с помощью имеющихся технологий и программного обеспечения;<br>
- умеют спроектировать, изготовить и разместить в сети веб-сайт объёмом 5—10 страниц на заданную тему;<br>
- владеют способами работы с изученными программами;<br>
- владеют приёмами организации и самоорганизации работы по изготовлению сайта;<br>
- имеют опыт коллективной разработки и публичной защиты созданного сайта;<br>
<p style="text-indent:20px">Качество продукции оценивается следующими способами:<br>
- по количеству творческих элементов в сайте;<br>
- по степени его оригинальности;<br>
- по относительной новизне сайта;<br>
- по емкости и лаконичности созданного сайта, по его интерактивности;<br>
- по практической пользе сайта и удобству его использования.<br><hr/>
</H4>
</body>
</html>

